
'''Напишите программу, которая помогает найти число.
Программа должна считывать размеры команд (два положительных целых числа a и b, каждое число вводится на отдельной строке)
и выводить наименьшее число d, которое делится на оба этих числа без остатка.'''
#=========================================================================================================================

a = int(input("1 число "))
b = int(input("2 число "))
c = 2
if a > 1 and b > 1:
    while True:
        if c % a == 0 and c % b == 0:
            print(c)
            break
        else:
            c += 1
#====================================================================================================================
#print(c)
# print(3 % 5)
a = float(input("1 число "))
b = float(input("2 число "))
print(a * b)