'''У нас есть пять любимых песен с именами A, B, C, D и E. Мы создали список воспроизведения
из этих песен и используем приложение для управления списком воспроизведения. Песни
начинаются в порядке A, B, C, D, E. В приложении есть четыре кнопки:
Кнопка 1: Перемещает первую песню из списка воспроизведения в конец списка воспроизведения.
Например, если список воспроизведения в данный момент A, B, C, D, E, то он
изменится на B, C, D, E, A.
Кнопка 2: Перемещает последнюю песню из списка воспроизведения в начало списка
воспроизведения. Например, если список воспроизведения в данный момент A, B, C, D, E, то он
изменится на E, A, B, C, D.
Кнопка 3: Меняет местами первые две песни из списка воспроизведения. Например,
если список воспроизведения в данный момент A, B, C, D, E, то он изменится на B, A,
C, D, E.
Кнопка 4: Воспроизведение списка воспроизведения!
Нам предоставляется возможность нажатия кнопки пользователем. Когда пользователь нажимает кнопку 4,
выведите порядок песен в списке воспроизведения".
'''
#====================================================================================================================


